In [99]:
import numpy as numpy
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [100]:
df=pd.read_csv("passenger_survival_dataset.csv")
df

,Passenger_ID,Name,Age,Gender,Class,Seat_Type,Fare_Paid,Survival_Status
0,1,Passenger_1,52,Male,Economy,Window,822.34,0
1,2,Passenger_2,15,Female,Economy,Middle,732.22,0
2,3,Passenger_3,72,Male,First,Aisle,957.75,1
3,4,Passenger_4,61,Female,Business,Middle,67.32,0
4,5,Passenger_5,21,Male,Economy,Aisle,235.99,0
...,...,...,...,...,...,...,...,...
495,496,Passenger_496,57,Male,Business,Window,771.43,0
496,497,Passenger_497,39,Male,Economy,Middle,477.25,1
497,498,Passenger_498,53,Male,Economy,Middle,787.88,0
498,499,Passenger_499,42,Male,Economy,Middle,112.10,1
499,500,Passenger_500,58,Male,Business,Middle,513.19,1

In [101]:
df.head()

,Passenger_ID,Name,Age,Gender,Class,Seat_Type,Fare_Paid,Survival_Status
0,1,Passenger_1,52,Male,Economy,Window,822.34,0
1,2,Passenger_2,15,Female,Economy,Middle,732.22,0
2,3,Passenger_3,72,Male,First,Aisle,957.75,1
3,4,Passenger_4,61,Female,Business,Middle,67.32,0
4,5,Passenger_5,21,Male,Economy,Aisle,235.99,0

In [102]:
df.tail()

,Passenger_ID,Name,Age,Gender,Class,Seat_Type,Fare_Paid,Survival_Status
495,496,Passenger_496,57,Male,Business,Window,771.43,0
496,497,Passenger_497,39,Male,Economy,Middle,477.25,1
497,498,Passenger_498,53,Male,Economy,Middle,787.88,0
498,499,Passenger_499,42,Male,Economy,Middle,112.10,1
499,500,Passenger_500,58,Male,Business,Middle,513.19,1

In [103]:
df.columns

Index(['Passenger_ID', 'Name', 'Age', 'Gender', 'Class', 'Seat_Type',
       'Fare_Paid', 'Survival_Status'],
      dtype='object')

In [104]:
df.shape

(500, 8)

In [105]:
df.nunique()

Passenger_ID       500
Name               500
Age                 79
Gender               2
Class                3
Seat_Type            3
Fare_Paid          498
Survival_Status      2
dtype: int64

In [106]:
df.describe()

       Passenger_ID         Age   Fare_Paid  Survival_Status
count    500.000000  500.000000  500.000000       500.000000
mean     250.500000   38.474000  521.357180         0.400000
std      144.481833   22.360799  273.883505         0.490389
min        1.000000    1.000000   53.060000         0.000000
25%      125.750000   19.000000  279.020000         0.000000
50%      250.500000   37.500000  530.695000         0.000000
75%      375.250000   58.250000  752.585000         1.000000
max      500.000000   79.000000  998.430000         1.000000

In [107]:
df.describe(include="object")

               Name Gender    Class Seat_Type
count           500    500      500       500
unique          500      2        3         3
top     Passenger_1   Male  Economy     Aisle
freq              1    264      300       177

In [108]:
df.isnull().sum()

Passenger_ID       0
Name               0
Age                0
Gender             0
Class              0
Seat_Type          0
Fare_Paid          0
Survival_Status    0
dtype: int64

In [109]:
df.duplicated().sum()

0

In [110]:
df.drop(columns=["Name"], inplace=True)

In [111]:
from sklearn.model_selection import train_test_split

In [112]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Passenger_ID     500 non-null    int64
 1   Age              500 non-null    int64
 2   Gender           500 non-null    object
 3   Class            500 non-null    object
 4   Seat_Type        500 non-null    object
 5   Fare_Paid        500 non-null    float64
 6   Survival_Status  500 non-null    int64
dtypes: float64(1), int64(3), object(3)
memory usage: 27.5+ KB

In [113]:
Class_mapping={"Business":0, "Economy":1, "First":2}

In [114]:
df["Class"]=df["Class"].map(Class_mapping)

In [115]:
df=pd.get_dummies(df,columns=["Gender"],dtype=int)

In [116]:
seat_mapping={"Window":0, "Middle":1, "Aisle":2}

In [117]:
df["Seat_Type"]=df["Seat_Type"].map(seat_mapping)

In [118]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Passenger_ID     500 non-null    int64
 1   Age              500 non-null    int64
 2   Class            500 non-null    int64
 3   Seat_Type        500 non-null    int64
 4   Fare_Paid        500 non-null    float64
 5   Survival_Status  500 non-null    int64
 6   Gender_Female    500 non-null    int32
 7   Gender_Male      500 non-null    int32
dtypes: float64(1), int32(2), int64(5)
memory usage: 27.5 KB

In [119]:
x=df[["Passenger_ID", "Age", "Class","Seat_Type","Fare_Paid","Gender_Female","Gender_Male"]]
y=df["Survival_Status"]

In [126]:
x.to_csv("x.csv", index=False)

In [120]:
X_train, X_test, y_train, y_test=train_test_split(x,y,test_size=0.2, random_state=42)

In [121]:
from sklearn.tree import DecisionTreeClassifier

In [122]:
from sklearn.metrics import accuracy_score,  classification_report

In [123]:


# Assuming X_train, X_test, y_train, y_test are already defined
model = DecisionTreeClassifier()
model.fit(X_train, y_train)
model.score(X_test, y_test)
predictions = model.predict(X_test)

print(accuracy_score(y_test, predictions))
print(classification_report(y_test, predictions))

0.45
              precision    recall  f1-score   support

           0       0.50      0.49      0.50        55
           1       0.39      0.40      0.40        45

    accuracy                           0.45       100
   macro avg       0.45      0.45      0.45       100
weighted avg       0.45      0.45      0.45       100

In [124]:
import pickle

In [125]:
file_name="passenger_survival_model.pkl"
with open (file_name,"wb") as file:
    pickle.dump(model,file)